Запрос = Новый Запрос;
Запрос.Текст = "ВЫБРАТЬ
 |	ЗаявкаНачальникаОтделения.Ссылка КАК Ссылка
 |ИЗ
 |	Документ.ЗаявкаНачальникаОтделения КАК ЗаявкаНачальникаОтделения
 |ГДЕ
 |	ЗаявкаНачальникаОтделения.Номер = &Номер
 |	И НачалоПериода(Дата,День) = &Дата";
Запрос.УстановитьПараметр("Номер","000000102");
Запрос.УстановитьПараметр("Дата",Дата('20220127'));
Результат = Запрос.Выполнить().Выбрать();
Пока Результат.Следующий() Цикл
	Рез = Результат.Ссылка;
КонецЦикла;

ТО = Перечисления.НарядЗаданиеВидОперации.ТО;
ОбследованиеТО = Перечисления.НарядЗаданиеВидОперации.ОбследованиеТО;
Запрос2 = Новый Запрос;
Запрос2.Текст = "ВЫБРАТЬ
|	Услуги.Ссылка КАК Ссылка,
|	Услуги.ОбъектОхраны КАК ОбъектОхраны,
|	Услуги.ОбъектОхраны.Код КАК Код
|ПОМЕСТИТЬ вТаб
|ИЗ
|	Документ.ЗаявкаНачальникаОтделения.Услуги КАК Услуги
|ГДЕ
|	Услуги.Ссылка = &Ссылка
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	НарядЗадание.Ссылка КАК Ссылка,
|	вТаб.ОбъектОхраны КАК ОбъектОхраны
|ИЗ
|	Документ.НарядЗадание КАК НарядЗадание
|		ПРАВОЕ СОЕДИНЕНИЕ вТаб КАК вТаб
|		ПО (НарядЗадание.Объект = вТаб.ОбъектОхраны)
|ГДЕ
|	НарядЗадание.ВидОперации В (&ВидОперации,&ВидОперации2)
|	И НАЧАЛОПЕРИОДА(НарядЗадание.Дата, ДЕНЬ) >= &Дата
|	И НарядЗадание.Объект.Код = вТаб.Код
|	И НарядЗадание.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыНарядовЗаданий.РаботаВыполнена)
|	И НарядЗадание.ПометкаУдаления = Ложь";
Запрос2.УстановитьПараметр("Ссылка",Рез);
Запрос2.УстановитьПараметр("ВидОперации",ТО);
Запрос2.УстановитьПараметр("ВидОперации2",ОбследованиеТО);
Запрос2.УстановитьПараметр("Дата",ТекущаяДата()-Дата(1,1,1));
Результат2 = Запрос2.Выполнить().Выбрать();

Пока Результат2.Следующий() Цикл
  РезНЗ = Результат2.Ссылка.ПолучитьОбъект();
  Сообщить(РезНЗ);
  //Скопировать = РезНЗ.Скопировать();
  //Скопировать.Дата = ТекущаяДата();
  //Скопировать.ПоручениеКлиента = "Последнее ТО проводилось менее 3 месяцев назад. БП не требуется";
  //Скопировать.ДатаНачалаПлан = ТекущаяДата();
  //Скопировать.ДатаОкончанияПлан = ТекущаяДата();
  //Скопировать.ДатаНачала = ТекущаяДата();
  //Скопировать.ДатаОкончания = ТекущаяДата();
  //Скопировать.ДопМонтажныеРаботы = ЛОЖЬ;
  //Скопировать.Комментарий = "Создан из "+Строка(Рез);
  //Скопировать.ВидПрибытияТехника = 2;
  //Скопировать.Записать(РежимЗаписиДокумента.Проведение);
КонецЦикла;