Запрос = Новый Запрос;
Запрос.Текст = "ВЫБРАТЬ 
|	СтруктураПредприятия.Ссылка КАК Ссылка
|	ПОМЕСТИТЬ вТаб
|Из
|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия;
|///////////////////
|ВЫБРАТЬ
|	ФинансоваяСтруктура.Ссылка КАК Ссылка,
|	ФинансоваяСтруктура.ЦФО КАК ЦФО,
|	ФинансоваяСтруктура.СтатьиРасходов КАК СтатьиРасходов,
|	вТаб.Ссылка КАК вТАбСсылка	
|ИЗ
|	Справочник.ФинансоваяСтруктура КАК ФинансоваяСтруктура
|	ЛЕВОЕ Соединение вТаб КАК вТаб
|	По ФинансоваяСтруктура.ЦФО = вТаб.Ссылка
|ГДЕ
|	ЦФО = &ЦФО";
Запрос.УстановитьПараметр("ЦФО",Справочники.СтруктураПредприятия.НайтиПокоду("000000008"));
Результат = Запрос.Выполнить().Выбрать();
Пока Результат.Следующий() Цикл
  Рез = Результат.Ссылка.ПолучитьОБъект();
  РезЦФО = Результат.вТАбСсылка.ПолучитьОбъект();
  
  Для Каждого Стр Из РезЦФО.СтатьиРасходов Цикл
	ДобавитьСтр = Рез.СтатьиРасходов.Добавить();
	ДобавитьСтр.СтатьяРасходов = Стр.СтатьяРасходов;
	
	КонецЦикла;
	Рез.Записать()
КонецЦикла;